yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152r8.h
#define SPI1_SR_RXNE             SPI1_SR_bit.RXNE
#define SPI1_SR_TXE              SPI1_SR_bit.TXE
#define SPI1_SR_WKUP             SPI1_SR_bit.WKUP
#define SPI1_SR_CRCERR           SPI1_SR_bit.CRCERR
#define SPI1_SR_MODF             SPI1_SR_bit.MODF
#define SPI1_SR_OVR              SPI1_SR_bit.OVR
#define SPI1_SR_BSY              SPI1_SR_bit.BSY

#define SPI1_TXCRCR_TXCRC        SPI1_TXCRCR_bit.TXCRC

#endif

/*-------------------------------------------------------------------------
 *      SPI1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SPI1_CR1_CPHA       0x01
#define MASK_SPI1_CR1_CPOL       0x02
#define MASK_SPI1_CR1_MSTR       0x04
#define MASK_SPI1_CR1_BR         0x38
#define MASK_SPI1_CR1_SPE        0x40
#define MASK_SPI1_CR1_LSBFIRST   0x80

#define MASK_SPI1_CR2_SSI        0x01
#define MASK_SPI1_CR2_SSM        0x02
#define MASK_SPI1_CR2_RXONLY     0x04
#define MASK_SPI1_CR2_CRCNEXT    0x10
#define MASK_SPI1_CR2_CRCEN      0x20
#define MASK_SPI1_CR2_BDOE       0x40
#define MASK_SPI1_CR2_BDM        0x80

#define MASK_SPI1_ICR_RXDMAEN    0x01
#define MASK_SPI1_ICR_TXDMAEN    0x02
#define MASK_SPI1_ICR_WKIE       0x10
#define MASK_SPI1_ICR_ERRIE      0x20
#define MASK_SPI1_ICR_RXIE       0x40
#define MASK_SPI1_ICR_TXIE       0x80

#define MASK_SPI1_SR_RXNE        0x01
#define MASK_SPI1_SR_TXE         0x02
#define MASK_SPI1_SR_WKUP        0x08
#define MASK_SPI1_SR_CRCERR      0x10
#define MASK_SPI1_SR_MODF        0x20
#define MASK_SPI1_SR_OVR         0x40
#define MASK_SPI1_SR_BSY         0x80

#define MASK_SPI1_TXCRCR_TXCRC   0x7F


/*-------------------------------------------------------------------------
 *      I2C1 register definitions
 *-----------------------------------------------------------------------*/
/* I2C1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char SMBUS       : 1;
  unsigned char             : 1;
  unsigned char SMBTYPE     : 1;
  unsigned char ENARP       : 1;
  unsigned char ENPEC       : 1;
  unsigned char ENGC        : 1;
  unsigned char NOSTRETCH   : 1;
} __BITS_I2C1_CR1;
#endif
__IO_REG8_BIT(I2C1_CR1,    0x5210, __READ_WRITE, __BITS_I2C1_CR1);

/* I2C1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char START       : 1;
  unsigned char STOP        : 1;
  unsigned char ACK         : 1;
  unsigned char POS         : 1;
  unsigned char PEC         : 1;
  unsigned char ALERT       : 1;
  unsigned char             : 1;
  unsigned char SWRST       : 1;
} __BITS_I2C1_CR2;
#endif
__IO_REG8_BIT(I2C1_CR2,    0x5211, __READ_WRITE, __BITS_I2C1_CR2);

/* I2C1 frequency register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FREQ        : 6;
} __BITS_I2C1_FREQR;
#endif
__IO_REG8_BIT(I2C1_FREQR,  0x5212, __READ_WRITE, __BITS_I2C1_FREQR);

/* I2C1 own address register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD0        : 1;
  unsigned char ADD1        : 1;
  unsigned char ADD2        : 1;
  unsigned char ADD3        : 1;
  unsigned char ADD4        : 1;
  unsigned char ADD5        : 1;
  unsigned char ADD6        : 1;
  unsigned char ADD7        : 1;
} __BITS_I2C1_OARL;
#endif
__IO_REG8_BIT(I2C1_OARL,   0x5213, __READ_WRITE, __BITS_I2C1_OARL);

/* I2C1 own address register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char ADD8        : 1;
  unsigned char ADD9        : 1;
  unsigned char             : 3;
  unsigned char ADDCONF     : 1;
  unsigned char ADDMODE     : 1;
} __BITS_I2C1_OARH;
#endif
__IO_REG8_BIT(I2C1_OARH,   0x5214, __READ_WRITE, __BITS_I2C1_OARH);

/* I2C1 own address register for dual mode */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ENDUAL      : 1;
  unsigned char ADD21       : 1;
  unsigned char ADD22       : 1;
  unsigned char ADD23       : 1;
  unsigned char ADD24       : 1;
  unsigned char ADD25       : 1;
  unsigned char ADD26       : 1;
  unsigned char ADD27       : 1;
} __BITS_I2C1_OAR2;
#endif
__IO_REG8_BIT(I2C1_OAR2,   0x5215, __READ_WRITE, __BITS_I2C1_OAR2);

/* I2C1 data register */
__IO_REG8    (I2C1_DR,     0x5216, __READ_WRITE);
/* I2C1 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SB          : 1;
  unsigned char ADDR        : 1;
  unsigned char BTF         : 1;
  unsigned char ADD10       : 1;
  unsigned char STOPF       : 1;
  unsigned char             : 1;
  unsigned char RXNE        : 1;
  unsigned char TXE         : 1;
} __BITS_I2C1_SR1;
#endif
__IO_REG8_BIT(I2C1_SR1,    0x5217, __READ, __BITS_I2C1_SR1);

/* I2C1 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BERR        : 1;
  unsigned char ARLO        : 1;
  unsigned char AF          : 1;
  unsigned char OVR         : 1;
  unsigned char PECERR      : 1;
  unsigned char WUFH        : 1;
  unsigned char TIMEOUT     : 1;
  unsigned char SMBALERT    : 1;
} __BITS_I2C1_SR2;
#endif
__IO_REG8_BIT(I2C1_SR2,    0x5218, __READ_WRITE, __BITS_I2C1_SR2);

/* I2C1 status register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MSL         : 1;
  unsigned char BUSY        : 1;
  unsigned char TRA         : 1;
  unsigned char             : 1;
  unsigned char GENCALL     : 1;
  unsigned char SMBDEFAULT  : 1;
  unsigned char SMBHOST     : 1;
} __BITS_I2C1_SR3;
#endif
__IO_REG8_BIT(I2C1_SR3,    0x5219, __READ, __BITS_I2C1_SR3);

/* I2C1 interrupt control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ITERREN     : 1;
  unsigned char ITEVTEN     : 1;
  unsigned char ITBUFEN     : 1;
  unsigned char DMAEN       : 1;
  unsigned char LAST        : 1;
} __BITS_I2C1_ITR;
#endif
__IO_REG8_BIT(I2C1_ITR,    0x521A, __READ_WRITE, __BITS_I2C1_ITR);

/* I2C1 clock control register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR0        : 1;
  unsigned char CCR1        : 1;
  unsigned char CCR2        : 1;
  unsigned char CCR3        : 1;
  unsigned char CCR4        : 1;
  unsigned char CCR5        : 1;
  unsigned char CCR6        : 1;
  unsigned char CCR7        : 1;
} __BITS_I2C1_CCRL;
#endif
__IO_REG8_BIT(I2C1_CCRL,   0x521B, __READ_WRITE, __BITS_I2C1_CCRL);

/* I2C1 clock control register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR8        : 1;
  unsigned char CCR9        : 1;
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char             : 2;
  unsigned char DUTY        : 1;
  unsigned char F_S         : 1;
} __BITS_I2C1_CCRH;
#endif
__IO_REG8_BIT(I2C1_CCRH,   0x521C, __READ_WRITE, __BITS_I2C1_CCRH);

/* I2C1 TRISE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRISE       : 6;
} __BITS_I2C1_TRISER;
#endif
__IO_REG8_BIT(I2C1_TRISER, 0x521D, __READ_WRITE, __BITS_I2C1_TRISER);

/* I2C1 packet error checking register */
__IO_REG8    (I2C1_PECR,   0x521E, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      I2C1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define I2C1_CR1_PE              I2C1_CR1_bit.PE
#define I2C1_CR1_SMBUS           I2C1_CR1_bit.SMBUS
#define I2C1_CR1_SMBTYPE         I2C1_CR1_bit.SMBTYPE
#define I2C1_CR1_ENARP           I2C1_CR1_bit.ENARP
#define I2C1_CR1_ENPEC           I2C1_CR1_bit.ENPEC
#define I2C1_CR1_ENGC            I2C1_CR1_bit.ENGC
#define I2C1_CR1_NOSTRETCH       I2C1_CR1_bit.NOSTRETCH

#define I2C1_CR2_START           I2C1_CR2_bit.START
#define I2C1_CR2_STOP            I2C1_CR2_bit.STOP
#define I2C1_CR2_ACK             I2C1_CR2_bit.ACK
#define I2C1_CR2_POS             I2C1_CR2_bit.POS
#define I2C1_CR2_PEC             I2C1_CR2_bit.PEC
#define I2C1_CR2_ALERT           I2C1_CR2_bit.ALERT
#define I2C1_CR2_SWRST           I2C1_CR2_bit.SWRST

