yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152r8.h
#define MASK_USART1_BRR2_USART_DIV0 0x01
#define MASK_USART1_BRR2_USART_DIV1 0x02
#define MASK_USART1_BRR2_USART_DIV2 0x04
#define MASK_USART1_BRR2_USART_DIV3 0x08
#define MASK_USART1_BRR2_USART_DIV12 0x10
#define MASK_USART1_BRR2_USART_DIV13 0x20
#define MASK_USART1_BRR2_USART_DIV14 0x40
#define MASK_USART1_BRR2_USART_DIV15 0x80

#define MASK_USART1_CR1_PIEN     0x01
#define MASK_USART1_CR1_PS       0x02
#define MASK_USART1_CR1_PCEN     0x04
#define MASK_USART1_CR1_WAKE     0x08
#define MASK_USART1_CR1_M        0x10
#define MASK_USART1_CR1_USARTD   0x20
#define MASK_USART1_CR1_T8       0x40
#define MASK_USART1_CR1_R8       0x80

#define MASK_USART1_CR2_SBK      0x01
#define MASK_USART1_CR2_RWU      0x02
#define MASK_USART1_CR2_REN      0x04
#define MASK_USART1_CR2_TEN      0x08
#define MASK_USART1_CR2_ILIEN    0x10
#define MASK_USART1_CR2_RIEN     0x20
#define MASK_USART1_CR2_TCIEN    0x40
#define MASK_USART1_CR2_TIEN     0x80

#define MASK_USART1_CR3_LBCL     0x01
#define MASK_USART1_CR3_CPHA     0x02
#define MASK_USART1_CR3_CPOL     0x04
#define MASK_USART1_CR3_CLKEN    0x08
#define MASK_USART1_CR3_STOP0    0x10
#define MASK_USART1_CR3_STOP1    0x20

#define MASK_USART1_CR4_ADD0     0x01
#define MASK_USART1_CR4_ADD1     0x02
#define MASK_USART1_CR4_ADD2     0x04
#define MASK_USART1_CR4_ADD3     0x08

#define MASK_USART1_CR5_EIE      0x01
#define MASK_USART1_CR5_IREN     0x02
#define MASK_USART1_CR5_IRLP     0x04
#define MASK_USART1_CR5_HDSEL    0x08
#define MASK_USART1_CR5_NACK     0x10
#define MASK_USART1_CR5_SCEN     0x20
#define MASK_USART1_CR5_DMAR     0x40
#define MASK_USART1_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      TIM2 register definitions
 *-----------------------------------------------------------------------*/
/* TIM2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM2_CR1;
#endif
__IO_REG8_BIT(TIM2_CR1,    0x5250, __READ_WRITE, __BITS_TIM2_CR1);

/* TIM2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 3;
  unsigned char CCDS        : 1;
  unsigned char MMS         : 3;
  unsigned char TI1S        : 1;
} __BITS_TIM2_CR2;
#endif
__IO_REG8_BIT(TIM2_CR2,    0x5251, __READ_WRITE, __BITS_TIM2_CR2);

/* TIM2 Slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM2_SMCR;
#endif
__IO_REG8_BIT(TIM2_SMCR,   0x5252, __READ_WRITE, __BITS_TIM2_SMCR);

/* TIM2 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM2_ETR;
#endif
__IO_REG8_BIT(TIM2_ETR,    0x5253, __READ_WRITE, __BITS_TIM2_ETR);

/* TIM2 DMA1 request enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UDE         : 1;
  unsigned char CC1DE       : 1;
  unsigned char CC2DE       : 1;
} __BITS_TIM2_DER;
#endif
__IO_REG8_BIT(TIM2_DER,    0x5254, __READ_WRITE, __BITS_TIM2_DER);

/* TIM2 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM2_IER;
#endif
__IO_REG8_BIT(TIM2_IER,    0x5255, __READ_WRITE, __BITS_TIM2_IER);

/* TIM2 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM2_SR1;
#endif
__IO_REG8_BIT(TIM2_SR1,    0x5256, __READ_WRITE, __BITS_TIM2_SR1);

/* TIM2 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM2_SR2;
#endif
__IO_REG8_BIT(TIM2_SR2,    0x5257, __READ_WRITE, __BITS_TIM2_SR2);

/* TIM2 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM2_EGR;
#endif
__IO_REG8_BIT(TIM2_EGR,    0x5258, __WRITE, __BITS_TIM2_EGR);

/* TIM2 capture/compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM2_CCMR1;
#endif
__IO_REG8_BIT(TIM2_CCMR1,  0x5259, __READ_WRITE, __BITS_TIM2_CCMR1);

/* TIM2 capture/compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM2_CCMR2;
#endif
__IO_REG8_BIT(TIM2_CCMR2,  0x525A, __READ_WRITE, __BITS_TIM2_CCMR2);

/* TIM2 capture/compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM2_CCER1;
#endif
__IO_REG8_BIT(TIM2_CCER1,  0x525B, __READ_WRITE, __BITS_TIM2_CCER1);

/* TIM2 counter high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT8        : 1;
  unsigned char CNT9        : 1;
  unsigned char CNT10       : 1;
  unsigned char CNT11       : 1;
  unsigned char CNT12       : 1;
  unsigned char CNT13       : 1;
  unsigned char CNT14       : 1;
  unsigned char CNT15       : 1;
} __BITS_TIM2_CNTRH;
#endif
__IO_REG8_BIT(TIM2_CNTRH,  0x525C, __READ_WRITE, __BITS_TIM2_CNTRH);

